# **2주차 Airflow 숙제**
  1. name, gender 읽어오기 ETL 버전 완성
  2. 서울 7일 평균/최소/최대 온도 읽어오기 (Full Fresh 버전)
  3. 서울 7일 평균/최소/최대 온도 읽어오기 (Incremental Update 버전) 

<br><hr>

Set up Configuration

In [ ]:
!pip install sqlalchemy==1.3.2

Collecting sqlalchemy==1.3.2
  Downloading SQLAlchemy-1.3.2.tar.gz (5.9 MB)
     |████████████████████████████████| 5.9 MB 20.0 MB/s
Building wheels for collected packages: sqlalchemy
  Building wheel for sqlalchemy (setup.py) ... done
  Created wheel for sqlalchemy: filename=SQLAlchemy-1.3.2-cp37-cp37m-linux_x86_64.whl size=1183050 sha256=76e2c4ca66224f6067b5022d5c0efed26a56de3fa8644ec0a5c7c89070119b15
  Stored in directory: /root/.cache/pip/wheels/c9/ff/38/1e6ab6f45b59ebbbd1b09808a2dce3550c19fca94a8d7a5b1d
Successfully built sqlalchemy
Installing collected packages: sqlalchemy
  Attempting uninstall: sqlalchemy
    Found existing installation: SQLAlchemy 1.4.25
    Uninstalling SQLAlchemy-1.4.25:
      Successfully uninstalled SQLAlchemy-1.4.25
Successfully installed sqlalchemy-1.3.2

In [ ]:
%load_ext sql

In [ ]:
%sql postgresql://user_id:password@ssde.cnqux5xggmn5.us-east-2.redshift.amazonaws.com:5439/dev

/usr/local/lib/python3.7/dist-packages/psycopg2/__init__.py:144: UserWarning: The psycopg2 wheel package will be renamed from release 2.8; in order to keep installing from binary please use "pip install psycopg2-binary" instead. For details see: <http://initd.org/psycopg/docs/install.html#binary-install-from-pypi>.
  """)

'Connected: seongeunyun@dev'

## Homework 1 : name, gender 읽어오기 ETL 버전 완성

1. FULL REFRESH 하는 형태로 실제로 Redshift 테이블에 쓰게 만들기
2. 각자 스키마 밑에 테이블 생성 (seongeunyun.name_gender)
3. Transaction 형태로 업데이트 구성
4. 멱등성 보장되는지 확인

In [ ]:
# ETL 함수 작성

import requests

def extract(url):
  f = requests.get(url)
  print("-- Extract Done --")
  return f.text

In [ ]:
import csv

def transform(data):
  reader = csv.reader(data.strip().split('\n'))
  print("-- Transform Done --")
  # print("== Original Data Count : ", len(list(reader)))
  return reader

In [ ]:
import psycopg2

# Redshift connection 함수
def get_Redshift_connection():
  host = "ssde.cnqux5xggmn5.us-east-2.redshift.amazonaws.com"
  redshift_user = "user_id"
  redshift_pass = "password"
  port = 5439
  dbname = "dev"

  conn = psycopg2.connect(f"dbname={dbname} user={redshift_user} host={host} password={redshift_pass} port={port}")
  conn.set_session(autocommit=True)
  print("-- Redshift Connected --")
  return conn.cursor()

In [ ]:
def load(csv_reader):
  cur = get_Redshift_connection()

  try:
    sql = """BEGIN;
            CREATE TABLE IF NOT EXISTS seongeunyun.name_gender (
              name varchar(64),
              gender varchar(16)
            );
            DELETE FROM seongeunyun.name_gender;"""

    cur.execute(sql)

    for name, gender in csv_reader:
      if name == "name" and gender =="gender":
        continue

      sql = f"""
            INSERT INTO seongeunyun.name_gender
            VALUES ('{name}', '{gender}');
            """
      cur.execute(sql)
    
    cur.execute("END")
    print("-- Data Successfully Inserted! --")

  except:
    print("Error!")
    cur.execute("ROLLBACK")

  else:
    cur.execute("SELECT count(1) FROM seongeunyun.name_gender;")
    count = cur.fetchone()[0]
    print("** Number of data inserted : ", count)

In [ ]:
# ETL 실행
url = "https://s3-geospatial.s3-us-west-2.amazonaws.com/name_gender.csv"

data = extract(url)
csv_reader = transform(data)
load(csv_reader)

-- Extract Done --
-- Transform Done --
-- Redshift Connected --
-- Data Successfully Inserted! --
** Number of data inserted :  100

In [ ]:
## data 가 잘 들어갔는지 확인
%%sql

SELECT count(1) FROM seongeunyun.name_gender;

 * postgresql://seongeunyun:***@ssde.cnqux5xggmn5.us-east-2.redshift.amazonaws.com:5439/dev
1 rows affected.

[(100,)]

In [ ]:
%%sql

SELECT * FROM seongeunyun.name_gender
LIMIT 10;

 * postgresql://seongeunyun:***@ssde.cnqux5xggmn5.us-east-2.redshift.amazonaws.com:5439/dev
10 rows affected.

[('Adaleigh', 'F'),
 ('Amryn', 'Unisex'),
 ('Apurva', 'Unisex'),
 ('Aryion', 'M'),
 ('Alixia', 'F'),
 ('Alyssarose', 'F'),
 ('Arvell', 'M'),
 ('Aibel', 'M'),
 ('Atiyyah', 'F'),
 ('Adlie', 'F')]

In [ ]:
# # 멱등성이 보장되는지 체크하기 위해, Table Drop 후 여러번 실행해봄 (반복 실행은 상단의 코드 이용)
# %%sql

# DROP TABLE seongeunyun.name_gender;

In [ ]:
# # 멱등성 체크용
# %%sql

# SELECT * FROM seongeunyun.name_gender;

## Homework 2 : 서울 7일 평균/최소/최대 온도 읽어오기 (Full Refresh 버전) 
1. Full Refresh 형태로 완성하여 Redshift에 테이블로 만들 것
2. API Key를 감출 방법을 찾아볼 것. 그런데 구글 Colab을 사용한다면 방법이 좀 번거롭게 됨
  - 보통은 환경변수에 저장하고 거기서 읽는 형태를 가짐
  - Airflow에서는 Airflow Variable라는 곳에 저장하게 됨

In [ ]:
# ETL 함수 작성
import requests
from datetime import datetime

WEATHER_API_URL = "https://api.openweathermap.org/data/2.5/onecall"
API_KEY = "your_api_key"

# latitude and longitude of Seoul, Korea
SEOUL_LAT = "37.5665"
SEOUL_LONG = "126.9780"


def extract_weather():
  params = {
      "lat" : SEOUL_LAT,
      "lon" : SEOUL_LONG,
      "appid" : API_KEY
  }
  
  response = requests.get(WEATHER_API_URL, params=params)
  response.raise_for_status()
  data = response.json()['daily']
  print("-- Extract Done --")
  return data

In [ ]:
def transform_weather(data):
  week_data = []

  for daily in data[1:]:
    date = datetime.fromtimestamp(daily["dt"]).strftime('%Y-%m-%d')
    avg_temp = daily["temp"]["day"]
    min_temp = daily["temp"]["min"]
    max_temp = daily["temp"]["max"]

    week_data.append([date, avg_temp, min_temp, max_temp])

  print('\n==> Original Data ==>')
  for row in week_data:
    print(row)
  print('=======================================\n')
  print("-- Transform Done --")

  return week_data

In [ ]:
def load_weather(week_data):
  cur = get_Redshift_connection()

  try:
    sql = """BEGIN;
            CREATE TABLE IF NOT EXISTS seongeunyun.weather_forecast_inc (
              date date primary key,
              temp float,
              min_temp float,
              max_temp float,
              updated_date timestamp default GETDATE()
            );
            
            DELETE FROM seongeunyun.weather_forecast_inc;"""

    cur.execute(sql)

    for date, temp, min_temp, max_temp in week_data:
      sql = f"""
            INSERT INTO seongeunyun.weather_forecast_inc (date, temp, min_temp, max_temp)
            VALUES ('{date}', '{temp}', '{min_temp}', '{max_temp}');
            """
      cur.execute(sql)
    
    cur.execute("END")
    print("-- Data Successfully Inserted! --")

  except:
    print("Error!")
    cur.execute("ROLLBACK")

  else:
    cur.execute("SELECT count(1) FROM seongeunyun.weather_forecast_inc;")
    count = cur.fetchone()[0]
    print("** Number of data inserted : ", count)

In [ ]:
# ETL 실행
json_data = extract_weather()
week_data = transform_weather(json_data)
load_weather(week_data)

-- Extract Done --

==> Original Data ==>
['2021-10-25', 289.04, 283.35, 290.43]
['2021-10-26', 288.96, 283.92, 289.79]
['2021-10-27', 290.48, 286.07, 290.87]
['2021-10-28', 289.3, 283.58, 291.29]
['2021-10-29', 290.56, 284.37, 292.18]
['2021-10-30', 290.46, 285.92, 291.61]
['2021-10-31', 290.51, 287, 291.43]
=======================================

-- Transform Done --
-- Redshift Connected --
-- Data Successfully Inserted! --
** Number of data inserted :  7

#### SQL for Data Validation

In [ ]:
## data 가 잘 들어갔는지 확인
%%sql

SELECT count(1) FROM seongeunyun.weather_forecast_inc;

 * postgresql://seongeunyun:***@ssde.cnqux5xggmn5.us-east-2.redshift.amazonaws.com:5439/dev
1 rows affected.

[(7,)]

In [ ]:
%%sql

SELECT * FROM seongeunyun.weather_forecast_inc
LIMIT 10;

 * postgresql://seongeunyun:***@ssde.cnqux5xggmn5.us-east-2.redshift.amazonaws.com:5439/dev
7 rows affected.

[(datetime.date(2021, 10, 25), 289.04, 283.35, 290.43, datetime.datetime(2021, 10, 24, 4, 20, 25)),
 (datetime.date(2021, 10, 26), 288.96, 283.92, 289.79, datetime.datetime(2021, 10, 24, 4, 20, 25)),
 (datetime.date(2021, 10, 27), 290.48, 286.07, 290.87, datetime.datetime(2021, 10, 24, 4, 20, 25)),
 (datetime.date(2021, 10, 28), 289.3, 283.58, 291.29, datetime.datetime(2021, 10, 24, 4, 20, 25)),
 (datetime.date(2021, 10, 29), 290.56, 284.37, 292.18, datetime.datetime(2021, 10, 24, 4, 20, 25)),
 (datetime.date(2021, 10, 30), 290.46, 285.92, 291.61, datetime.datetime(2021, 10, 24, 4, 20, 25)),
 (datetime.date(2021, 10, 31), 290.51, 287.0, 291.43, datetime.datetime(2021, 10, 24, 4, 20, 25))]

## Homework 3: 서울 7일 평균/최소/최대 온도 읽어오기 (Incremental Update 버전)
  - 앞서 full fresh로 만든 버전을 매일매일 앞으로 일주일 데이터만 최신으로 갱신하도록 해볼 것

In [ ]:
def load_weather_new(week_data):
  cur = get_Redshift_connection()

  try:
    # copy org Table to temp Table 
    sql = """BEGIN;
            CREATE TABLE IF NOT EXISTS seongeunyun.weather_forecast (
              date date primary key,
              temp float,
              min_temp float,
              max_temp float,
              updated_date timestamp default GETDATE()
           );

            DROP TABLE IF EXISTS seongeunyun.temp_weather_forecast;

            CREATE TABLE IF NOT EXISTS seongeunyun.temp_weather_forecast (
              date date primary key,
              temp float,
              min_temp float,
              max_temp float,
              updated_date timestamp default GETDATE()
           );

            INSERT INTO seongeunyun.temp_weather_forecast 
            SELECT * FROM seongeunyun.weather_forecast;"""

        # 이렇게 만들면 updated_date 에 자꾸 None 값이 들어가서, create table 후 insert 하는 방법으로 query 변경
        # """
        #   CREATE TABLE seongeunyun.temp_weather_forecast 
        #   AS SELECT * FROM seongeunyun.weather_forecast;"""

    cur.execute(sql)

    print("\nload --> create temp_table : Completed")

    cur.execute("SELECT count(1) FROM seongeunyun.weather_forecast;")
    org_count = cur.fetchone()[0]

    print(f"load --> org_count - {org_count} : Completed")

    # ETL to temp Table
    for date, temp, min_temp, max_temp in week_data:
      sql = f"""
            INSERT INTO seongeunyun.temp_weather_forecast (date, temp, min_temp, max_temp)
            VALUES ('{date}', '{temp}', '{min_temp}', '{max_temp}');
            """
      cur.execute(sql)

    print("load --> ETL to temp_table : Completed")

    cur.execute("SELECT count(1) FROM seongeunyun.temp_weather_forecast;")
    temp_count = cur.fetchone()[0]

    print(f"load --> Original Data : {org_count} / Temp Data : {temp_count}")

    # temp Table 에 데이터가 제대로 들어갔는지 검증 (org Table 데이터수 + 7일치 데이터)    
    if int(org_count) + 7 != int(temp_count):
      raise ValueError('Some Data is missing!')

    print("load --> Data inspection : Completed")

    # org Table 지우고, temp Table 에서 중복 배제한 data를 org Table 로 넣어줌
    sql = """DELETE FROM seongeunyun.weather_forecast;

            INSERT INTO seongeunyun.weather_forecast 
            SELECT date, temp, min_temp, max_temp, updated_date
              FROM (SELECT *, ROW_NUMBER() OVER (PARTITION BY date ORDER BY updated_date DESC) seq
                    FROM seongeunyun.temp_weather_forecast)
              WHERE seq = 1
              ORDER BY date;"""
    
    cur.execute(sql)

    cur.execute("END")
    print("\n-- Data Successfully Inserted! --")

  except:
    print("Error!")
    cur.execute("ROLLBACK")

  else:
    cur.execute("SELECT count(1) FROM seongeunyun.weather_forecast;")
    count = cur.fetchone()[0]
    print("\n** Number of data inserted to org_table : ", count)

In [ ]:
# ETL 실행
json_data = extract_weather()
week_data = transform_weather(json_data)
load_weather_new(week_data)

-- Extract Done --

==> Original Data ==>
['2021-10-25', 289.04, 283.35, 290.43]
['2021-10-26', 288.96, 283.92, 289.79]
['2021-10-27', 290.48, 286.07, 290.87]
['2021-10-28', 289.3, 283.58, 291.29]
['2021-10-29', 290.56, 284.37, 292.18]
['2021-10-30', 290.46, 285.92, 291.61]
['2021-10-31', 290.51, 287, 291.43]
=======================================

-- Transform Done --
-- Redshift Connected --

load --> create temp_table : Completed
load --> org_count - 8 : Completed
load --> ETL to temp_table : Completed
load --> Original Data : 8 / Temp Data : 15
load --> Data inspection : Completed

-- Data Successfully Inserted! --

** Number of data inserted to org_table :  8

### SQL for Data Validation

In [ ]:
# CREATE TABLE seongeunyun.temp2_weather_forecast 
# AS SELECT * FROM seongeunyun.weather_forecast;"""

%%sql

SELECT * from seongeunyun.temp2_weather_forecast;

 * postgresql://seongeunyun:***@ssde.cnqux5xggmn5.us-east-2.redshift.amazonaws.com:5439/dev
8 rows affected.

[(datetime.date(2021, 10, 28), 289.3, 283.58, 291.29, datetime.datetime(2021, 10, 24, 4, 20, 35)),
 (datetime.date(2021, 10, 25), 289.04, 283.35, 290.43, datetime.datetime(2021, 10, 24, 4, 20, 31)),
 (datetime.date(2021, 10, 29), 290.56, 284.37, 292.18, datetime.datetime(2021, 10, 24, 4, 20, 35)),
 (datetime.date(2021, 10, 26), 288.96, 283.92, 289.79, datetime.datetime(2021, 10, 24, 4, 20, 35)),
 (datetime.date(2021, 10, 30), 290.46, 285.92, 291.61, datetime.datetime(2021, 10, 24, 4, 20, 35)),
 (datetime.date(2021, 10, 27), 290.48, 286.07, 290.87, datetime.datetime(2021, 10, 24, 4, 20, 35)),
 (datetime.date(2021, 10, 24), 288.97, 283.09, 290.07, datetime.datetime(2021, 10, 23, 4, 24, 28)),
 (datetime.date(2021, 10, 31), 290.51, 287.0, 291.43, datetime.datetime(2021, 10, 24, 4, 20, 35))]

In [ ]:
# 테이블이 만들어졌는지 확인
%%sql

SELECT * FROM seongeunyun.weather_forecast
ORDER BY date;

 * postgresql://seongeunyun:***@ssde.cnqux5xggmn5.us-east-2.redshift.amazonaws.com:5439/dev
8 rows affected.

[(datetime.date(2021, 10, 24), 288.97, 283.09, 290.07, datetime.datetime(2021, 10, 23, 4, 24, 28)),
 (datetime.date(2021, 10, 25), 289.04, 283.35, 290.43, datetime.datetime(2021, 10, 24, 4, 20, 31)),
 (datetime.date(2021, 10, 26), 288.96, 283.92, 289.79, datetime.datetime(2021, 10, 24, 4, 20, 35)),
 (datetime.date(2021, 10, 27), 290.48, 286.07, 290.87, datetime.datetime(2021, 10, 24, 4, 20, 35)),
 (datetime.date(2021, 10, 28), 289.3, 283.58, 291.29, datetime.datetime(2021, 10, 24, 4, 20, 35)),
 (datetime.date(2021, 10, 29), 290.56, 284.37, 292.18, datetime.datetime(2021, 10, 24, 4, 20, 35)),
 (datetime.date(2021, 10, 30), 290.46, 285.92, 291.61, datetime.datetime(2021, 10, 24, 4, 20, 35)),
 (datetime.date(2021, 10, 31), 290.51, 287.0, 291.43, datetime.datetime(2021, 10, 24, 4, 20, 35))]

In [ ]:
%%sql

SELECT * FROM seongeunyun.temp_weather_forecast;

 * postgresql://seongeunyun:***@ssde.cnqux5xggmn5.us-east-2.redshift.amazonaws.com:5439/dev
15 rows affected.

[(datetime.date(2021, 10, 24), 288.97, 283.09, 290.07, datetime.datetime(2021, 10, 23, 4, 24, 28)),
 (datetime.date(2021, 10, 31), 291.3, 287.1, 292.65, datetime.datetime(2021, 10, 23, 19, 43, 9)),
 (datetime.date(2021, 10, 30), 289.41, 285.85, 291.03, datetime.datetime(2021, 10, 23, 19, 43, 9)),
 (datetime.date(2021, 10, 27), 289.93, 286.16, 290.88, datetime.datetime(2021, 10, 23, 19, 43, 9)),
 (datetime.date(2021, 10, 26), 288.96, 283.92, 289.79, datetime.datetime(2021, 10, 24, 4, 20, 35)),
 (datetime.date(2021, 10, 27), 290.48, 286.07, 290.87, datetime.datetime(2021, 10, 24, 4, 20, 35)),
 (datetime.date(2021, 10, 29), 290.56, 284.37, 292.18, datetime.datetime(2021, 10, 24, 4, 20, 35)),
 (datetime.date(2021, 10, 30), 290.46, 285.92, 291.61, datetime.datetime(2021, 10, 24, 4, 20, 35)),
 (datetime.date(2021, 10, 31), 290.51, 287.0, 291.43, datetime.datetime(2021, 10, 24, 4, 20, 35)),
 (datetime.date(2021, 10, 29), 290.33, 284.27, 292.05, datetime.datetime(2021, 10, 23, 19, 43, 9)),
 (datetime.date(2021, 10, 26), 289.43, 284.31, 290.65, datetime.datetime(2021, 10, 23, 19, 43, 9)),
 (datetime.date(2021, 10, 28), 289.47, 283.78, 291.33, datetime.datetime(2021, 10, 23, 19, 43, 9)),
 (datetime.date(2021, 10, 25), 289.09, 283.28, 290.48, datetime.datetime(2021, 10, 23, 19, 43, 9)),
 (datetime.date(2021, 10, 25), 289.04, 283.35, 290.43, datetime.datetime(2021, 10, 24, 4, 20, 31)),
 (datetime.date(2021, 10, 28), 289.3, 283.58, 291.29, datetime.datetime(2021, 10, 24, 4, 20, 35))]

In [ ]:
# temp_table 에서 가장 최근에 입력된 data만 확인
%%sql

SELECT date, temp, min_temp, max_temp, updated_date
FROM (SELECT *, ROW_NUMBER() OVER (PARTITION BY date ORDER BY updated_date DESC) seq
      FROM seongeunyun.temp_weather_forecast)
WHERE seq = 1
ORDER BY date;

 * postgresql://seongeunyun:***@ssde.cnqux5xggmn5.us-east-2.redshift.amazonaws.com:5439/dev
8 rows affected.

[(datetime.date(2021, 10, 24), 288.97, 283.09, 290.07, datetime.datetime(2021, 10, 23, 4, 24, 28)),
 (datetime.date(2021, 10, 25), 289.04, 283.35, 290.43, datetime.datetime(2021, 10, 24, 4, 20, 31)),
 (datetime.date(2021, 10, 26), 288.96, 283.92, 289.79, datetime.datetime(2021, 10, 24, 4, 20, 35)),
 (datetime.date(2021, 10, 27), 290.48, 286.07, 290.87, datetime.datetime(2021, 10, 24, 4, 20, 35)),
 (datetime.date(2021, 10, 28), 289.3, 283.58, 291.29, datetime.datetime(2021, 10, 24, 4, 20, 35)),
 (datetime.date(2021, 10, 29), 290.56, 284.37, 292.18, datetime.datetime(2021, 10, 24, 4, 20, 35)),
 (datetime.date(2021, 10, 30), 290.46, 285.92, 291.61, datetime.datetime(2021, 10, 24, 4, 20, 35)),
 (datetime.date(2021, 10, 31), 290.51, 287.0, 291.43, datetime.datetime(2021, 10, 24, 4, 20, 35))]

In [ ]:
# 소스 코드 에러 발생시 테스트용
# %%sql

# DROP TABLE seongeunyun.weather_forecast;
# DROP TABLE seongeunyun.temp_weather_forecast;